# NurbsCurveGetNumPieces

## Description
Returns the number of pieces that compose the referenced NURBS curve.

```pascal
FUNCTION NurbsCurveGetNumPieces(objectHd : HANDLE) : INTEGER;
```

```python

def vs.NurbsCurveGetNumPieces(objectHd):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHd|HANDLE|Handle to NURBS curve.|

## Returns
An INTEGER count of the pieces composing the curve.

## Version
Availability: from VectorWorks9.0
## Category
* Objects - NURBS